SET NAMES UTF8;
DROP DATABASE IF EXISTS movie;
CREATE DATABASE movie CHARSET=UTF8;
USE movie;

-- 用户
CREATE TABLE movie_user(
  u_id INT PRIMARY KEY AUTO_INCREMENT,
  uphone CHAR(11) NOT NULL,
  upwd VARCHAR(20) NOT NULL,
  uname VARCHAR(20) NOT NULL
);
-- index 首页
-- 添加用户的原始信息
INSERT INTO movie_user VALUES
(NULL,"18874556958","123456","dingding"),
(NULL,"18596325863","abc123","dangdang");

-- 轮播图
CREATE TABLE move_lunbo(
  id INT PRIMARY key AUTO_INCREMENT,
  img_url VARCHAR(64),
  title VARCHAR(25)
);

-- 向轮播图列表插入数据
INSERT INTO move_lunbo VALUES
(NULL,"img/index/nav01.jpg","<<决战食神>>"),
(NULL,"img/index/nav02.jpg","<<掠夺者>>"),
(NULL,"img/index/nav03.jpg","<<摆渡>>"),
(NULL,"img/index/nav04.jpg","<<蝙蝠侠大战超人>>"),
(NULL,"img/index/nav05.jpg","<<倒霉熊特工>>");

-- 创建一楼列表页movie_oFList
CREATE TABLE movie_oFList(
  id INT PRIMARY KEY AUTO_INCREMENT,
  title VARCHAR(255)
);

-- 向列表页中插入数据
INSERT INTO movie_oFList VALUES
(NULL,"《三少爷的剑》徐克尔冬升联手淬炼 何润东"),
(NULL,"《五女闹东京》发先导预告 五 “铁蜜”变身古惑仔"),
(NULL,"《怨灵地下室》今天上映 民国背景融入"),
(NULL,"《喵星人》定档2017暑期斥资2亿打造"),
(NULL,"《游戏规则》发燃情版预告 黄子韬开启"),
(NULL,"《阿瑟圣诞》惊恐情版预告 权志龙开启");

-- 热播影视
CREATE TABLE movie_rbys(
  id INT PRIMARY KEY AUTO_INCREMENT,
  img_url VARCHAR(64),
  title VARCHAR(32),
  num INT
);

-- 热播影视 插入数据
INSERT INTO movie_rbys VALUES
(NULL,"img/index/rpys01.jpg","放弃我 抓紧我",25),
(NULL,"img/index/rpys02.jpg","北上广依然相信爱情",33),
(NULL,"img/index/rpys03.jpg","追婚记",12),
(NULL,"img/index/rpys04.jpg","我的岳父会武术",20),
(NULL,"img/index/rpys05.jpg","老公们的私房钱",15),
(NULL,"img/index/rpys06.jpg","美人私房菜",22),
(NULL,"img/index/rpys07.jpg","微能力者",33),
(NULL,"img/index/rpys08.jpg","爸爸去哪儿(第四季)",14),
(NULL,"img/index/rpys09.jpg","器灵",12),
(NULL,"img/index/rpys10.jpg","鬼吹灯之精绝古城",28),
(NULL,"img/index/rpys11.jpg","蓝色大海的传说",26),
(NULL,"img/index/rpys12.jpg","相爱穿梭千年2",34);

-- 创建电视节目表
CREATE TABLE movie_dsjm(
  id INT PRIMARY KEY AUTO_INCREMENT,
  img_url VARCHAR(64),
  title VARCHAR(25),
  title1 VARCHAR(25),
  title2 VARCHAR(25),
  title3 VARCHAR(25),
  time1 VARCHAR(64),
  time2 VARCHAR(64),
  time3 VARCHAR(64)
);

-- 往电视节目表中插入数据
INSERT INTO movie_dsjm VALUES
(NULL,"img/index/tv01.gif","CCTV1综合","猝火成钢(25集)","猝火成钢(26集)","猝火成钢(27集)","21:00","22:00","23:00"),
(NULL,"img/index/tv02.jpg","CCTV2综合","我是特种兵(25集)","我是特种兵(26集)","我是特种兵(27集)","21:05","22:05","23:05"),
(NULL,"img/index/tv03.jpg","CCTV5综合","我的团(25集)","我的团(26集)","我的团(27集)","21:10","22:10","23:10"),
(NULL,"img/index/tv04.gif","湖南卫视","小兵张嘎(25集)","小兵张嘎(26集)","小兵张嘎(27集)","21:20","22:20","23:20"),
(NULL,"img/index/tv05.gif","江苏卫视","少年包青天(25集)","少年包青天(26集)","少年包青天(27集)","21:30","22:30","23:30"),
(NULL,"img/index/tv06.jpg","浙江卫视","亮剑(25集)","亮剑(26集)","亮剑(27集)","21:40","22:40","23:40"),
(NULL,"img/index/tv02.jpg","CCTV2综合","我是特种兵(25集)","我是特种兵(26集)","我是特种兵(27集)","21:05","22:05","23:05"),
(NULL,"img/index/tv03.jpg","CCTV5综合","我的团(25集)","我的团(26集)","我的团(27集)","21:10","22:10","23:10"),
(NULL,"img/index/tv06.jpg","浙江卫视","亮剑(25集)","亮剑(26集)","亮剑(27集)","21:40","22:40","23:40"),
(NULL,"img/index/tv05.gif","江苏卫视","少年包青天(25集)","少年包青天(26集)","少年包青天(27集)","21:30","22:30","23:30"),
(NULL,"img/index/tv04.gif","湖南卫视","小兵张嘎(25集)","小兵张嘎(26集)","小兵张嘎(27集)","21:20","22:20","23:20"),
(NULL,"img/index/tv01.gif","CCTV1综合","猝火成钢(25集)","猝火成钢(26集)","猝火成钢(27集)","21:00","22:00","23:00");

-- 创建电视剧排行表 movie_rank
CREATE TABLE movie_rank(
  id INT PRIMARY KEY AUTO_INCREMENT,
  title VARCHAR(25),
  num INT
);

-- 向电视剧排行表插入数据
INSERT INTO movie_rank VALUES
(NULL,"蓝色大海传说",13),
(NULL,"亮剑",10),
(NULL,"少年包青天",23),
(NULL,"我的团",58),
(NULL,"我是特种兵",15),
(NULL,"相爱穿梭千年2",35),
(NULL,"鬼吹灯之精绝古城",26),
(NULL,"器灵",41),
(NULL,"放弃我 抓紧我",33),
(NULL,"美人私房菜",23),
(NULL,"微能力者",31),
(NULL,"小兵张嘎",16);

-- 今日影视
-- 热门影视
CREATE TABLE jrys_rbys(
  id INT PRIMARY KEY AUTO_INCREMENT,
  title VARCHAR(25),
  img_url VARCHAR(128),
  uname VARCHAR(64),
  mold VARCHAR(25),
  year INT,
  num INT
);

-- 往热门影视插入数据
INSERT INTO jrys_rbys VALUES
(NULL,"孤战","img/jrys/hot02.jpg","姚安莲/田阜/冯恩雀","国产剧","2016","26"),
(NULL,"乱世丽人行","img/jrys/hot01.jpg","付新福/韩雪/毛琳琳","国产剧","2017","28"),
(NULL,"守护丽人","img/jrys/hot03.jpg","李小璐/张泽/李智楠","国产剧","2018","33"),
(NULL,"最后一张签证","img/jrys/hot04.jpg","王雷/陈宝国/赵擎/张静静","国产剧","2015","25"),
(NULL,"遇见爱情的利先生","img/jrys/hot05.jpg","周冬雨/陈晓/叶青","国产剧","2017","24"),
(NULL,"一年级毕业季","img/jrys/hot06.jpg","陈一冰/娄艺潇/张智霖","综艺节目","2016","22"),
(NULL,"孤芳不自赏","img/jrys/hot07.jpg","钟汉良/杨颖/甘婷婷","国产剧","2018","28"),
(NULL,"最强大脑(第四季)","img/jrys/hot08.jpg","陶金林/刘国梁","综艺节目","2017","19"),
(NULL,"鬼怪","img/jrys/hot09.jpg","孔侑/李东旭/金恩","韩国剧","2017","15"),
(NULL,"漂亮的李慧珍","img/jrys/hot10.jpg","德丽热巴/盛一伦/李茜茜","国产剧","2018","12");

-- 今日影视 左则列表 jrys_left
CREATE TABLE jrys_left(
  id INT PRIMARY KEY AUTO_INCREMENT,
  day VARCHAR(25),
  img VARCHAR(25),
  title VARCHAR(25),
  uname VARCHAR(128),
  auther VARCHAR(25),
  lx VARCHAR(25),
  area VARCHAR(25),
  num INT
);

INSERT INTO jrys_left VALUES
(NULL,"2019-01-25","img/jrys/jjmu01.jpg","功夫瑜伽","成龙 张艺兴 母其弥雅 李治廷 索努·苏德 尚语贤","唐季礼","动作片","大陆",2017),
(NULL,"2019-01-25","img/jrys/jjmu02.jpg","大闹天竺","王宝强 白客 柳岩 岳云鹏","王宝强","喜剧片","大陆",2018),
(NULL,"2019-01-15","img/jrys/jjmu03.jpg","西游伏妖篇","姚晨 吴亦凡 林更新 巴特尔 汪铎 林允 包贝尔","徐克","剧情片","大陆",2017),
(NULL,"2019-01-14","img/jrys/jjmu04.jpg","乘风破浪","邓超 赵丽颖 董子健 高华阳","韩寒","剧情片","大陆",2016),
(NULL,"2019-01-08","img/jrys/jjmu05.jpg","熊出没之奇幻空间","尚雯婕 鲍春来 孙建弘","丁亮","动漫","大陆",2018),
(NULL,"2019-01-07","img/jrys/jjmu06.jpg","降临","艾米·亚当斯 杰瑞米·雷纳 福里斯特·惠特克 迈克尔·斯图巴","丹尼斯·维伦纽瓦","科幻片","美国",2017),
(NULL,"2019-01-01","img/jrys/jjmu07.jpg","心惊胆战","惠英红 陈颖欣 黄德斌 余秋瑶 周广超","陈鹏振","恐怖片","香港",2016),
(NULL,"2018-12-25","img/jrys/jjmu08.jpg","大魔法师孟兜兜","郭太旭 尹冠霖 刘一含","孟晖","动漫","大陆",2016),
(NULL,"2018-12-25","img/jrys/jjmu09.jpg","蛋计划","胡婷 周微 孟雨田 刘莉 李芬 郑莹莹 杨家兴 王征","李扬武","动漫","大陆",2017),
(NULL,"2018-12-25","img/jrys/jjmu10.jpg","少年巴比伦","董子健 李梦 尚铁龙 李大光 唐小然","相国强","剧情片","大陆",2018),
(NULL,"2019-01-25","img/jrys/jjmu02.jpg","大闹天竺","王宝强 白客 柳岩 岳云鹏","王宝强","喜剧片","大陆",2017),
(NULL,"2019-01-25","img/jrys/jjmu01.jpg","功夫瑜伽","成龙 张艺兴 母其弥雅 李治廷 索努·苏德 尚语贤","唐季礼","动作片","大陆",2018),
(NULL,"2019-01-14","img/jrys/jjmu04.jpg","乘风破浪","邓超 赵丽颖 董子健 高华阳","韩寒","剧情片","大陆",2017),
(NULL,"2019-01-15","img/jrys/jjmu03.jpg","西游伏妖篇","姚晨 吴亦凡 林更新 巴特尔 汪铎 林允 包贝尔","徐克","剧情片","大陆",2015),
(NULL,"2019-01-08","img/jrys/jjmu05.jpg","熊出没之奇幻空间","尚雯婕 鲍春来 孙建弘","丁亮","动漫","大陆",2017),
(NULL,"2019-01-01","img/jrys/jjmu07.jpg","心惊胆战","惠英红 陈颖欣 黄德斌 余秋瑶 周广超","陈鹏振","恐怖片","香港",2017),
(NULL,"2019-01-07","img/jrys/jjmu06.jpg","降临","艾米·亚当斯 杰瑞米·雷纳 福里斯特·惠特克 迈克尔·斯图巴","丹尼斯·维伦纽瓦","科幻片","美国",2018),
(NULL,"2018-12-25","img/jrys/jjmu08.jpg","大魔法师孟兜兜","郭太旭 尹冠霖 刘一含","孟晖","动漫","大陆",2017),
(NULL,"2018-12-25","img/jrys/jjmu10.jpg","少年巴比伦","董子健 李梦 尚铁龙 李大光 唐小然","相国强","剧情片","大陆",2018),
(NULL,"2019-01-25","img/jrys/jjmu01.jpg","功夫瑜伽","成龙 张艺兴 母其弥雅 李治廷 索努·苏德 尚语贤","唐季礼","动作片","大陆",2016),
(NULL,"2018-12-25","img/jrys/jjmu09.jpg","蛋计划","胡婷 周微 孟雨田 刘莉 李芬 郑莹莹 杨家兴 王征","李扬武","动漫","大陆",2018),
(NULL,"2019-01-25","img/jrys/jjmu02.jpg","大闹天竺","王宝强 白客 柳岩 岳云鹏","王宝强","喜剧片","大陆",2017),
(NULL,"2019-01-14","img/jrys/jjmu04.jpg","乘风破浪","邓超 赵丽颖 董子健 高华阳","韩寒","剧情片","大陆",2018),
(NULL,"2019-01-08","img/jrys/jjmu05.jpg","熊出没之奇幻空间","尚雯婕 鲍春来 孙建弘","丁亮","动漫","大陆",2017),
(NULL,"2019-01-15","img/jrys/jjmu03.jpg","西游伏妖篇","姚晨 吴亦凡 林更新 巴特尔 汪铎 林允 包贝尔","徐克","剧情片","大陆",2016),
(NULL,"2019-01-01","img/jrys/jjmu07.jpg","心惊胆战","惠英红 陈颖欣 黄德斌 余秋瑶 周广超","陈鹏振","恐怖片","香港",2017),
(NULL,"2018-12-25","img/jrys/jjmu08.jpg","大魔法师孟兜兜","郭太旭 尹冠霖 刘一含","孟晖","动漫","大陆",2018),
(NULL,"2019-01-07","img/jrys/jjmu06.jpg","降临","艾米·亚当斯 杰瑞米·雷纳 福里斯特·惠特克 迈克尔·斯图巴","丹尼斯·维伦纽瓦","科幻片","美国",2015),
(NULL,"2018-12-25","img/jrys/jjmu09.jpg","蛋计划","胡婷 周微 孟雨田 刘莉 李芬 郑莹莹 杨家兴 王征","李扬武","动漫","大陆",2017),
(NULL,"2019-01-07","img/jrys/jjmu06.jpg","降临","艾米·亚当斯 杰瑞米·雷纳 福里斯特·惠特克 迈克尔·斯图巴","丹尼斯·维伦纽瓦","科幻片","美国",2018),
(NULL,"2019-01-01","img/jrys/jjmu07.jpg","心惊胆战","惠英红 陈颖欣 黄德斌 余秋瑶 周广超","陈鹏振","恐怖片","香港",2017),
(NULL,"2018-12-25","img/jrys/jjmu10.jpg","少年巴比伦","董子健 李梦 尚铁龙 李大光 唐小然","相国强","剧情片","大陆",2018),
(NULL,"2018-12-25","img/jrys/jjmu08.jpg","大魔法师孟兜兜","郭太旭 尹冠霖 刘一含","孟晖","动漫","大陆",2017),
(NULL,"2018-12-25","img/jrys/jjmu10.jpg","少年巴比伦","董子健 李梦 尚铁龙 李大光 唐小然","相国强","剧情片","大陆",2016),
(NULL,"2018-12-25","img/jrys/jjmu09.jpg","蛋计划","胡婷 周微 孟雨田 刘莉 李芬 郑莹莹 杨家兴 王征","李扬武","动漫","大陆",2017);


-- 电影票房
-- 电影票房 柱形表
CREATE TABLE dypf_pillar(
  id INT PRIMARY KEY AUTO_INCREMENT,
  title VARCHAR(25),
  num DOUBLE
);

-- 往柱形表插入数据
INSERT INTO dypf_pillar VALUES
(NULL,"西游伏妖篇",61.7),
(NULL,"大闹天竺",32.6),
(NULL,"功夫瑜伽",29.9),
(NULL,"乘风破浪",14.7),
(NULL,"熊出没之奇幻空间",13.5),
(NULL,"降临",10.1),
(NULL,"魔旋传说",4.3),
(NULL,"少年巴比伦",3.7),
(NULL,"我的诗篇",3.4),
(NULL,"心惊胆战",1.7),
(NULL,"蛋计划",0.5),
(NULL,"梦魔法师萌兜兜",0.2);

-- 电影票房 表格表 dypf_table
CREATE TABLE dypf_table(
  id INT PRIMARY KEY AUTO_INCREMENT,
  movie_name VARCHAR(25),
  auther VARCHAR(4),
  day VARCHAR(25),
  num1 INT,
  num2 VARCHAR(25)
);

-- 向电影票房 表格表 插入数据
INSERT INTO dypf_table VALUES
(NULL,"西妖伏魔篇","徐克","2017-01-28",2,"6.17亿"),
(NULL,"大闹天竺","王宝强","2017-01-28",2,"3.26亿"),
(NULL,"功夫瑜伽","唐吉利","2017-01-28",2,"2.99亿"),
(NULL,"乘风破浪","韩寒","2017-01-28",2,"1.47亿"),
(NULL,"奇幻空间","丁亮","2017-01-28",2,"1.35亿"),
(NULL,"降临","丹尼斯·维伦纽瓦","2017-01-20",10,"1.01亿"),
(NULL,"魔弦传说","特拉维斯·奈特","2017-01-13",17,"4292.7万"),
(NULL,"少年巴比伦","相国强","2017-01-13",17,"307.2万"),
(NULL,"我的诗篇","吴飞跃/秦晓宇","2017-01-13",17,"304.9万"),
(NULL,"心惊胆战","陈鹏振","2017-01-20",10,"171.6万"),
(NULL,"蛋计划","李扬武","2017-01-20",10,"54.5万"),
(NULL,"大魔法师孟兜兜","孟晖","2017-01-20",10,"20.4万");

-- 热映影视 ryys_list
CREATE TABLE ryys_list(
  id INT PRIMARY KEY AUTO_INCREMENT,
  img_url VARCHAR(25),
  title VARCHAR(512)
);

INSERT INTO ryys_list VALUES
(NULL,"img/ryys/hot01.jpg","简介：1943年，一份我党潜伏汪伪和军统的人员名单因负责人的被捕，被锁在上海银行保险箱。共产党员陈晓奉命利用指纹术制作指纹套以取出名单。行动失败，保险箱钥匙被汪伪特工部得到，联系人宋姐在牺牲前要陈晓务必拿到名单。"),
(NULL,"img/ryys/hot02.jpg","简介：抗战时期的上海，进步女青年韩疏影被婶婶陷害，被迫嫁给苏北大亨谢丙炎做妾室。在爱国教师历文轩的感召下，韩疏影决定逃婚投入救国行列，却因和谢家大少爷谢天赐的同学关系，被谢家大小姐谢若雪发现。"),
(NULL,"img/ryys/hot03.jpg","简介：幼年时，林佳因家中变故被父亲林世渊独自一人含辛茹苦带大。林佳长大后格外任性，做事不计后果。林世渊意识到女儿的问题，为挽救女儿，将其赶出家门，让她从基层职工做起，接受社会锻炼与改造。失去富裕生活的林佳负气出走、流落街头，被北京胡同里土生土长的快递员陈曦所救。"),
(NULL,"img/ryys/hot04.jpg","简介：1937年，上海沦陷，出身外交世家的普济州因不满与姚素珍指腹为婚，在其婚礼上，竟然当场逃婚，辗转至中国驻奥地利维也纳领事馆任职，并与其偶像女小提琴家海伦雨中邂逅。"),
(NULL,"img/ryys/hot05.jpg","简介：刘欣桐，一个成长在贫民之家的的女孩，可是却始终不改阳光坚强的本性。她的生活原本平淡无奇，然而一次意外，她进入了一个截然不同的生活圈子，和母亲迫不得已搬进了富商纪百均的家里。自此，刘欣桐的生活发生了翻天覆地的变化。"),
(NULL,"img/ryys/hot07.jpg","简介：晋、燕、凉、秦四国征战不休，晋国国力最强，晋国国王亲弟镇北王楚北捷（钟汉良饰）英勇善战、武功谋略过人，令其他三国闻风丧胆。晋燕交战之际，燕国敬安王府遭到围陷，一夜之间王府覆灭。"),
(NULL,"img/ryys/hot10.jpg","简介：从小生活完美的公主李慧珍因家道中落沦为“龙套女”，成了初入职场处处碰壁的菜鸟。而小时候的“矮胖挫”白皓宇却变身高富帅海归。"),
(NULL,"img/ryys/tv01.jpg","简介： 一次意外溺水，长时间脑部缺氧让著名服装设计师厉薇薇失去了部分记忆，她的记忆停留在23岁。记忆中热恋的同为设计师的男友竟成了竞争对手，而一个陌生人却成了她的未婚夫。厉薇薇不相信自己会和前男友陈亦度分手，她努力调查前因。未婚夫霍骁为了保护薇薇，追回自己的未婚妻，千方百计阻挠薇薇调查，守在她周围。"),
(NULL,"img/ryys/tv02.jpg","简介： 该剧讲述了宋朝时期拥有皇家血统的玉蝶流落民间，后跟着五嫂在民间长大，并得五嫂祖传御厨技艺，长大后宋玉蝶成为闻名江南的名厨，与嫉恶如仇的五嫂义子李马相恋，因为战争的原因始终不能跟李马长相厮守，后为了避免金兵攻打宋朝，牺牲个人的感情来挽救国家命运和民族的故事。"),
(NULL,"img/ryys/tv03.jpg","简介：身为三姐妹之长的白芍，在受老爸白守城管束三十年之后，终于迎来了把老爸“嫁“出去的好日子，然而白父却因对三个女儿不放心，不愿意与老伴儿张姨出国定居。为让老爸放心出国，以便自己获得自由，白芍与不打不相识的混血大男孩陆六安开始了假扮情侣的戏码。"),
(NULL,"img/ryys/tv04.jpg","简介：该剧讲述派出所丁所长退休后，儿女的婚姻大事问题一直令他忧心的故事。"),
(NULL,"img/ryys/tv05.jpg","简介：平凡少年莫明自幼失去父亲，被母亲艰难抚养长大，他总是希望用自己的方式去守护自己在乎的人。一次意外，莫明不幸被卷入了天工会与九卿两大御灵师集团之间的斗争，并发现了“器灵”这一存在——他怎么也想不到，那些貌似古董的武器，竟然能幻化成美丽的女孩，还能够进行战斗。"),
(NULL,"img/ryys/tv06.jpg","简介：王茂与黄依然在洛芙婚庆公司是上下级关系，两人从相识的那一刻起就充满矛盾，由于两人的文化差异，使彼此都不能理解。"),
(NULL,"img/ryys/tv07.jpg","简介： 住北京的郑妈妈有三个闺女三个女婿，由于郑妈妈教女有方，一大家子日子过得其乐融融无比蜜甜。可突如其来的一段录音却让郑妈妈怀疑已去世的老伴曾经藏有私房钱。为防止女儿们的家庭不稳，郑妈妈郑重其事地嘱咐三个女儿要想把自己的老公看住，必须从私房钱查起。"),
(NULL,"img/ryys/tv09.jpg","简介：胡八一、Shirley杨与王胖子一起历经万险来到了塔克拉玛干沙漠中的精绝古城遗址寻找“鬼洞”的故事。 胡八一上山下乡来到中蒙边境的岗岗营子，带上了家中仅存的一本书——《十六字阴阳风水秘术》，闲来无事将书中文字背得滚瓜烂熟。之后参军到西藏，遇上雪崩掉落一条巨大的地沟当中，胡八一利用自己懂得的墓葬秘术逃得不死。"),
(NULL,"img/ryys/tv10.jpg","简介：林三因意外被迫以低级家丁身份进入萧府大宅，遭逢无数奇遇，帮助萧府在商场、官场翻云覆雨，齐家治国平天下，成为“天下第一丁”的故事。"),
(NULL,"img/ryys/mouse01.jpg","简介： 战国时期，七雄争霸。齐将田忌之女田夕率兵与魏军交战，原以为胜券在握，不料却被半路杀出的孙膑用匪夷所思的计谋打败，手下伤亡惨重。田夕满怀悲愤力擒孙膑，原本想杀了他为齐国将士报仇，谁知求贤若渴的齐王却下令赦免闯下大祸的孙膑。"),
(NULL,"img/ryys/mouse02.jpg","简介： 道姆·柯布与同事阿瑟和纳什在一次针对日本能源大亨齐藤的盗梦行动中失败，反被齐藤利用。齐藤威逼利诱因遭通缉而流亡海外的柯布帮他拆分他竞争对手的公司，采取极端措施在其唯一继承人罗伯特·费希尔的深层潜意识中种下放弃家族公司、自立门户的想法。"),
(NULL,"img/ryys/mouse03.jpg","简介： 影片讲述的故事发生在虚拟的未来世界，那时的英国变成了一个由萨特勒所统治的法西斯极权主义国家，人民生活方在残暴的统治下，疾病、饥荒、灰暗，且秘密警察无处不在。"),
(NULL,"img/ryys/mouse04.jpg","简介： “13 岁”奏响了青春序曲的第一个音符。七月与安生从踏入中学校门的一刻起，便宿命般地成为了朋友。她们一个恬静如水，一个张扬似火，性格截然不同、却又互相吸引。");
-- (NULL,"img/ryys/mouse05.jpg","简介：菜鸟警察尼克，第一次执行任务就一命归西。死去的尼克匪夷所思地飘到了一个叫“冥界警局”的部门。"),
-- (NULL,"img/ryys/hot01.jpg","简介：1943年，一份我党潜伏汪伪和军统的人员名单因负责人的被捕，被锁在上海银行保险箱。共产党员陈晓奉命利用指纹术制作指纹套以取出名单。行动失败，保险箱钥匙被汪伪特工部得到，联系人宋姐在牺牲前要陈晓务必拿到名单。"),
-- (NULL,"img/ryys/hot02.jpg","简介：抗战时期的上海，进步女青年韩疏影被婶婶陷害，被迫嫁给苏北大亨谢丙炎做妾室。在爱国教师历文轩的感召下，韩疏影决定逃婚投入救国行列，却因和谢家大少爷谢天赐的同学关系，被谢家大小姐谢若雪发现。"),
-- (NULL,"img/ryys/hot03.jpg","简介：幼年时，林佳因家中变故被父亲林世渊独自一人含辛茹苦带大。林佳长大后格外任性，做事不计后果。林世渊意识到女儿的问题，为挽救女儿，将其赶出家门，让她从基层职工做起，接受社会锻炼与改造。失去富裕生活的林佳负气出走、流落街头，被北京胡同里土生土长的快递员陈曦所救。");


-- 电视剧 左则列表 dsj_left
CREATE TABLE dsj_left(
  id INT PRIMARY KEY AUTO_INCREMENT,
  day VARCHAR(25),
  img VARCHAR(25),
  title VARCHAR(25),
  uname VARCHAR(128),
  auther VARCHAR(25),
  lx VARCHAR(25),
  area VARCHAR(25),
  num INT
);

INSERT INTO dsj_left VALUES
(NULL,"2019-01-25","img/jrys/jjmu01.jpg","功夫瑜伽","成龙 张艺兴 ","唐季礼","动作片","大陆",2017),
(NULL,"2019-01-25","img/jrys/jjmu02.jpg","大闹天竺","王宝强 白客","王宝强","喜剧片","大陆",2018),
(NULL,"2019-01-15","img/jrys/jjmu03.jpg","西游伏妖篇","姚晨 吴亦凡 ","徐克","剧情片","大陆",2017),
(NULL,"2019-01-14","img/jrys/jjmu04.jpg","乘风破浪","邓超 赵丽颖 ","韩寒","剧情片","大陆",2016),
(NULL,"2019-01-08","img/jrys/jjmu05.jpg","熊出没之奇幻空间","尚雯婕 鲍春来 孙建弘","丁亮","动漫","大陆",2018),
(NULL,"2019-01-07","img/jrys/jjmu06.jpg","降临","艾米·亚当斯 杰瑞米·雷纳","丹尼斯·维伦纽瓦","科幻片","美国",2017),
(NULL,"2019-01-01","img/jrys/jjmu07.jpg","心惊胆战","惠英红 陈颖欣","陈鹏振","恐怖片","香港",2016),
(NULL,"2018-12-25","img/jrys/jjmu08.jpg","大魔法师孟兜兜","郭太旭 尹冠霖","孟晖","动漫","大陆",2016),
(NULL,"2018-12-25","img/jrys/jjmu09.jpg","蛋计划","胡婷 周微","李扬武","动漫","大陆",2017),
(NULL,"2018-12-25","img/jrys/jjmu10.jpg","少年巴比伦","董子健 李梦","相国强","剧情片","大陆",2018),
(NULL,"2019-01-25","img/jrys/jjmu02.jpg","大闹天竺","王宝强 白客","王宝强","喜剧片","大陆",2017),
(NULL,"2019-01-25","img/jrys/jjmu01.jpg","功夫瑜伽","成龙 张艺兴","唐季礼","动作片","大陆",2018),
(NULL,"2019-01-14","img/jrys/jjmu04.jpg","乘风破浪","邓超 赵丽颖","韩寒","剧情片","大陆",2017),
(NULL,"2019-01-15","img/jrys/jjmu03.jpg","西游伏妖篇","姚晨 吴亦凡","徐克","剧情片","大陆",2015),
(NULL,"2019-01-08","img/jrys/jjmu05.jpg","熊出没之奇幻空间","尚雯婕 鲍春来 孙建弘","丁亮","动漫","大陆",2017),
(NULL,"2019-01-01","img/jrys/jjmu07.jpg","心惊胆战","惠英红 陈颖欣","陈鹏振","恐怖片","香港",2017),
(NULL,"2019-01-07","img/jrys/jjmu06.jpg","降临","艾米·亚当斯 杰瑞米·雷纳","丹尼斯·维伦纽瓦","科幻片","美国",2018),
(NULL,"2018-12-25","img/jrys/jjmu08.jpg","大魔法师孟兜兜","郭太旭 尹冠霖","孟晖","动漫","大陆",2017),
(NULL,"2018-12-25","img/jrys/jjmu10.jpg","少年巴比伦","董子健 李梦","相国强","剧情片","大陆",2018),
(NULL,"2019-01-25","img/jrys/jjmu01.jpg","功夫瑜伽","成龙 张艺兴","唐季礼","动作片","大陆",2016),
(NULL,"2018-12-25","img/jrys/jjmu09.jpg","蛋计划","胡婷 周微","李扬武","动漫","大陆",2018),
(NULL,"2019-01-25","img/jrys/jjmu02.jpg","大闹天竺","王宝强 白客","王宝强","喜剧片","大陆",2017),
(NULL,"2019-01-14","img/jrys/jjmu04.jpg","乘风破浪","邓超 赵丽颖","韩寒","剧情片","大陆",2018),
(NULL,"2019-01-08","img/jrys/jjmu05.jpg","熊出没之奇幻空间","尚雯婕 鲍春来 孙建弘","丁亮","动漫","大陆",2017),
(NULL,"2019-01-15","img/jrys/jjmu03.jpg","西游伏妖篇","姚晨 吴亦凡","徐克","剧情片","大陆",2016),
(NULL,"2019-01-01","img/jrys/jjmu07.jpg","心惊胆战","惠英红 陈颖欣","陈鹏振","恐怖片","香港",2017),
(NULL,"2018-12-25","img/jrys/jjmu08.jpg","大魔法师孟兜兜","郭太旭 尹冠霖","孟晖","动漫","大陆",2018),
(NULL,"2019-01-07","img/jrys/jjmu06.jpg","降临","艾米·亚当斯 杰瑞米·雷纳","丹尼斯·维伦纽瓦","科幻片","美国",2015),
(NULL,"2018-12-25","img/jrys/jjmu09.jpg","蛋计划","胡婷 周微","李扬武","动漫","大陆",2017),
(NULL,"2019-01-07","img/jrys/jjmu06.jpg","降临","艾米·亚当斯 杰瑞米·雷纳","丹尼斯·维伦纽瓦","科幻片","美国",2018),
(NULL,"2019-01-01","img/jrys/jjmu07.jpg","心惊胆战","惠英红 陈颖欣","陈鹏振","恐怖片","香港",2017),
(NULL,"2018-12-25","img/jrys/jjmu10.jpg","少年巴比伦","董子健 李梦","相国强","剧情片","大陆",2018),
(NULL,"2018-12-25","img/jrys/jjmu08.jpg","大魔法师孟兜兜","郭太旭 尹冠霖","孟晖","动漫","大陆",2017),
(NULL,"2018-12-25","img/jrys/jjmu10.jpg","少年巴比伦","董子健 李梦","相国强","剧情片","大陆",2016),
(NULL,"2018-12-25","img/jrys/jjmu09.jpg","蛋计划","胡婷 周微","李扬武","动漫","大陆",2017);